In [1]:
import pandas as pd
import numpy as np

In [15]:
df = pd.DataFrame({'A':[1,6,np.nan],
                  'B':[7,np.nan,np.nan],
                  'C':[6,7,8]})

In [17]:
df

     A    B  C
0  1.0  7.0  6
1  6.0  NaN  7
2  NaN  NaN  8

In [19]:
df.dropna()

     A    B  C
0  1.0  7.0  6

In [21]:
df.dropna(axis=0)

     A    B  C
0  1.0  7.0  6

In [23]:
df.dropna(axis=1)

   C
0  6
1  7
2  8

In [32]:
df.dropna(thresh=3)

     A    B  C
0  1.0  7.0  6

In [36]:
df.dropna(thresh=2)

     A    B  C
0  1.0  7.0  6
1  6.0  NaN  7

In [40]:
df.fillna(value='enter value')

             A            B  C
0          1.0          7.0  6
1          6.0  enter value  7
2  enter value  enter value  8

In [42]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    6.0
2    3.5
Name: A, dtype: float64

In [44]:
df

     A    B  C
0  1.0  7.0  6
1  6.0  NaN  7
2  NaN  NaN  8